Found 8513 files belonging to 18 classes.
Using 6811 files for training.
Found 8513 files belonging to 18 classes.
Using 1702 files for validation.
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 142, 254, 32)      896       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 71, 127, 32)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 69, 125, 64)       18496     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 34, 62, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 60, 64)        36928     
_________________________________________________________________
flatten (Flatten)            (None, 122880)            0         
_________________________________________________________________
dense (Dense)                (None, 64)                7864384   
_________________________________________________________________
dense_1 (Dense)              (None, 18)                1170      
=================================================================
Total params: 7,921,874
Trainable params: 7,921,874
Non-trainable params: 0
_________________________________________________________________
  1/213 [..............................] - ETA: 13:41 - loss: 28.4405 - accuracy: 0.0938  2/213 [..............................] - ETA: 10:31 - loss: 881.7481 - accuracy: 0.0781  3/213 [..............................] - ETA: 10:19 - loss: 796.8770 - accuracy: 0.0729  4/213 [..............................] - ETA: 10:19 - loss: 658.7936 - accuracy: 0.0781  5/213 [..............................] - ETA: 10:28 - loss: 535.1478 - accuracy: 0.0812  6/213 [..............................] - ETA: 10:20 - loss: 447.4561 - accuracy: 0.0885  7/213 [..............................] - ETA: 10:24 - loss: 384.6550 - accuracy: 0.0759  8/213 [>.............................] - ETA: 10:20 - loss: 337.5277 - accuracy: 0.0742  9/213 [>.............................] - ETA: 10:16 - loss: 300.9298 - accuracy: 0.0868 10/213 [>.............................] - ETA: 10:08 - loss: 271.1490 - accuracy: 0.0781 11/213 [>.............................] - ETA: 10:01 - loss: 246.7636 - accuracy: 0.0767 12/213 [>.............................] - ETA: 9:55 - loss: 226.4389 - accuracy: 0.0755  13/213 [>.............................] - ETA: 9:51 - loss: 209.2336 - accuracy: 0.0793 14/213 [>.............................] - ETA: 9:49 - loss: 194.4907 - accuracy: 0.0871 15/213 [=>............................] - ETA: 9:42 - loss: 181.7078 - accuracy: 0.0979 16/213 [=>............................] - ETA: 9:37 - loss: 170.5277 - accuracy: 0.0977 17/213 [=>............................] - ETA: 9:32 - loss: 160.6623 - accuracy: 0.0956 18/213 [=>............................] - ETA: 9:26 - loss: 151.8823 - accuracy: 0.1007 19/213 [=>............................] - ETA: 9:23 - loss: 144.0302 - accuracy: 0.1036 20/213 [=>............................] - ETA: 9:19 - loss: 136.9679 - accuracy: 0.1031 21/213 [=>............................] - ETA: 9:15 - loss: 130.5775 - accuracy: 0.1057 22/213 [==>...........................] - ETA: 9:15 - loss: 124.7619 - accuracy: 0.1065 23/213 [==>...........................] - ETA: 9:11 - loss: 119.4623 - accuracy: 0.1087 24/213 [==>...........................] - ETA: 9:07 - loss: 114.5945 - accuracy: 0.1120 25/213 [==>...........................] - ETA: 9:04 - loss: 110.1086 - accuracy: 0.1187 26/213 [==>...........................] - ETA: 9:01 - loss: 105.9686 - accuracy: 0.1214 27/213 [==>...........................] - ETA: 8:59 - loss: 102.1378 - accuracy: 0.1238 28/213 [==>...........................] - ETA: 8:55 - loss: 98.5802 - accuracy: 0.1250  29/213 [===>..........................] - ETA: 8:52 - loss: 95.2760 - accuracy: 0.1250 30/213 [===>..........................] - ETA: 8:48 - loss: 92.1862 - accuracy: 0.1271 31/213 [===>..........................] - ETA: 8:45 - loss: 89.2760 - accuracy: 0.1351 32/213 [===>..........................] - ETA: 8:41 - loss: 86.5655 - accuracy: 0.1377 33/213 [===>..........................] - ETA: 8:38 - loss: 84.0230 - accuracy: 0.1373 34/213 [===>..........................] - ETA: 8:34 - loss: 81.6189 - accuracy: 0.1425 35/213 [===>..........................] - ETA: 8:31 - loss: 79.3593 - accuracy: 0.1429 36/213 [====>.........................] - ETA: 8:28 - loss: 77.2226 - accuracy: 0.1467 37/213 [====>.........................] - ETA: 8:24 - loss: 75.2083 - accuracy: 0.1520 38/213 [====>.........................] - ETA: 8:21 - loss: 73.2834 - accuracy: 0.1579 39/213 [====>.........................] - ETA: 8:18 - loss: 71.4639 - accuracy: 0.1619 40/213 [====>.........................] - ETA: 8:15 - loss: 69.7315 - accuracy: 0.1648 41/213 [====>.........................] - ETA: 8:11 - loss: 68.0871 - accuracy: 0.1669 42/213 [====>.........................] - ETA: 8:08 - loss: 66.5155 - accuracy: 0.1704 43/213 [=====>........................] - ETA: 8:05 - loss: 65.0280 - accuracy: 0.1737 44/213 [=====>........................] - ETA: 8:02 - loss: 63.5977 - accuracy: 0.1768 45/213 [=====>........................] - ETA: 7:59 - loss: 62.2374 - accuracy: 0.1764 46/213 [=====>........................] - ETA: 7:55 - loss: 60.9324 - accuracy: 0.1807 47/213 [=====>........................] - ETA: 7:52 - loss: 59.6885 - accuracy: 0.1822 48/213 [=====>........................] - ETA: 7:49 - loss: 58.4895 - accuracy: 0.1842 49/213 [=====>........................] - ETA: 7:46 - loss: 57.3415 - accuracy: 0.1875 50/213 [======>.......................] - ETA: 7:43 - loss: 56.2355 - accuracy: 0.1900 51/213 [======>.......................] - ETA: 7:40 - loss: 55.1761 - accuracy: 0.1942 52/213 [======>.......................] - ETA: 7:38 - loss: 54.1541 - accuracy: 0.1989 53/213 [======>.......................] - ETA: 7:35 - loss: 53.1730 - accuracy: 0.2011 54/213 [======>.......................] - ETA: 7:31 - loss: 52.2244 - accuracy: 0.2043 55/213 [======>.......................] - ETA: 7:28 - loss: 51.3093 - accuracy: 0.2080 56/213 [======>.......................] - ETA: 7:25 - loss: 50.4316 - accuracy: 0.2115 57/213 [=======>......................] - ETA: 7:22 - loss: 49.5837 - accuracy: 0.2127 58/213 [=======>......................] - ETA: 7:19 - loss: 48.7714 - accuracy: 0.2134 59/213 [=======>......................] - ETA: 7:16 - loss: 47.9727 - accuracy: 0.2177 60/213 [=======>......................] - ETA: 7:13 - loss: 47.2090 - accuracy: 0.2198 61/213 [=======>......................] - ETA: 7:10 - loss: 46.4665 - accuracy: 0.2223 62/213 [=======>......................] - ETA: 7:07 - loss: 45.7471 - accuracy: 0.2253 63/213 [=======>......................] - ETA: 7:04 - loss: 45.0517 - accuracy: 0.2277 64/213 [========>.....................] - ETA: 7:01 - loss: 44.3760 - accuracy: 0.2310 65/213 [========>.....................] - ETA: 6:58 - loss: 43.7262 - accuracy: 0.2303 66/213 [========>.....................] - ETA: 6:55 - loss: 43.1034 - accuracy: 0.2315 67/213 [========>.....................] - ETA: 6:52 - loss: 42.4970 - accuracy: 0.2341 68/213 [========>.....................] - ETA: 6:49 - loss: 41.8970 - accuracy: 0.2376 69/213 [========>.....................] - ETA: 6:46 - loss: 41.3162 - accuracy: 0.2405 70/213 [========>.....................] - ETA: 6:43 - loss: 40.7596 - accuracy: 0.2429 71/213 [=========>....................] - ETA: 6:40 - loss: 40.2119 - accuracy: 0.2443 72/213 [=========>....................] - ETA: 6:37 - loss: 39.6834 - accuracy: 0.2448 73/213 [=========>....................] - ETA: 6:34 - loss: 39.1687 - accuracy: 0.2453 74/213 [=========>....................] - ETA: 6:31 - loss: 38.6707 - accuracy: 0.2475 75/213 [=========>....................] - ETA: 6:28 - loss: 38.1839 - accuracy: 0.2492 76/213 [=========>....................] - ETA: 6:25 - loss: 37.7109 - accuracy: 0.2500 77/213 [=========>....................] - ETA: 6:22 - loss: 37.2553 - accuracy: 0.2524 78/213 [=========>....................] - ETA: 6:20 - loss: 36.8032 - accuracy: 0.2540 79/213 [==========>...................] - ETA: 6:17 - loss: 36.3802 - accuracy: 0.2544 80/213 [==========>...................] - ETA: 6:14 - loss: 35.9565 - accuracy: 0.2562 81/213 [==========>...................] - ETA: 6:11 - loss: 35.5370 - accuracy: 0.2581 82/213 [==========>...................] - ETA: 6:08 - loss: 35.1293 - accuracy: 0.2599 83/213 [==========>...................] - ETA: 6:05 - loss: 34.7336 - accuracy: 0.2605 84/213 [==========>...................] - ETA: 6:02 - loss: 34.3453 - accuracy: 0.2619 85/213 [==========>...................] - ETA: 5:59 - loss: 33.9647 - accuracy: 0.2640 86/213 [===========>..................] - ETA: 5:56 - loss: 33.5959 - accuracy: 0.2642 87/213 [===========>..................] - ETA: 5:53 - loss: 33.2358 - accuracy: 0.2647 88/213 [===========>..................] - ETA: 5:50 - loss: 32.8818 - accuracy: 0.2660 89/213 [===========>..................] - ETA: 5:48 - loss: 32.5326 - accuracy: 0.2679 90/213 [===========>..................] - ETA: 5:45 - loss: 32.2016 - accuracy: 0.2677 91/213 [===========>..................] - ETA: 5:42 - loss: 31.8715 - accuracy: 0.2689 92/213 [===========>..................] - ETA: 5:39 - loss: 31.5499 - accuracy: 0.2687 93/213 [============>.................] - ETA: 5:36 - loss: 31.2341 - accuracy: 0.2698 94/213 [============>.................] - ETA: 5:33 - loss: 30.9238 - accuracy: 0.2709 95/213 [============>.................] - ETA: 5:31 - loss: 30.6202 - accuracy: 0.2730 96/213 [============>.................] - ETA: 5:28 - loss: 30.3274 - accuracy: 0.2731 97/213 [============>.................] - ETA: 5:25 - loss: 30.0364 - accuracy: 0.2748 98/213 [============>.................] - ETA: 5:22 - loss: 29.7542 - accuracy: 0.2752 99/213 [============>.................] - ETA: 5:19 - loss: 29.4754 - accuracy: 0.2771100/213 [=============>................] - ETA: 5:16 - loss: 29.2026 - accuracy: 0.2778101/213 [=============>................] - ETA: 5:13 - loss: 28.9370 - accuracy: 0.2782102/213 [=============>................] - ETA: 5:11 - loss: 28.6713 - accuracy: 0.2803103/213 [=============>................] - ETA: 5:07 - loss: 28.4139 - accuracy: 0.2812104/213 [=============>................] - ETA: 5:05 - loss: 28.1563 - accuracy: 0.2843105/213 [=============>................] - ETA: 5:02 - loss: 27.9094 - accuracy: 0.2854106/213 [=============>................] - ETA: 4:59 - loss: 27.6644 - accuracy: 0.2860107/213 [==============>...............] - ETA: 4:56 - loss: 27.4235 - accuracy: 0.2877108/213 [==============>...............] - ETA: 4:53 - loss: 27.1842 - accuracy: 0.2908109/213 [==============>...............] - ETA: 4:50 - loss: 26.9530 - accuracy: 0.2924110/213 [==============>...............] - ETA: 4:48 - loss: 26.7250 - accuracy: 0.2935111/213 [==============>...............] - ETA: 4:45 - loss: 26.5009 - accuracy: 0.2950112/213 [==============>...............] - ETA: 4:42 - loss: 26.2850 - accuracy: 0.2963113/213 [==============>...............] - ETA: 4:39 - loss: 26.0638 - accuracy: 0.2992114/213 [===============>..............] - ETA: 4:36 - loss: 25.8516 - accuracy: 0.3002115/213 [===============>..............] - ETA: 4:34 - loss: 25.6443 - accuracy: 0.3008116/213 [===============>..............] - ETA: 4:31 - loss: 25.4436 - accuracy: 0.3009117/213 [===============>..............] - ETA: 4:28 - loss: 25.2453 - accuracy: 0.3007118/213 [===============>..............] - ETA: 4:25 - loss: 25.0480 - accuracy: 0.3016119/213 [===============>..............] - ETA: 4:22 - loss: 24.8575 - accuracy: 0.3017120/213 [===============>..............] - ETA: 4:19 - loss: 24.6679 - accuracy: 0.3026121/213 [================>.............] - ETA: 4:16 - loss: 24.4827 - accuracy: 0.3032122/213 [================>.............] - ETA: 4:14 - loss: 24.2969 - accuracy: 0.3048123/213 [================>.............] - ETA: 4:11 - loss: 24.1153 - accuracy: 0.3054124/213 [================>.............] - ETA: 4:08 - loss: 23.9337 - accuracy: 0.3065125/213 [================>.............] - ETA: 4:05 - loss: 23.7620 - accuracy: 0.3063126/213 [================>.............] - ETA: 4:02 - loss: 23.5901 - accuracy: 0.3070127/213 [================>.............] - ETA: 3:59 - loss: 23.4182 - accuracy: 0.3083128/213 [=================>............] - ETA: 3:57 - loss: 23.2523 - accuracy: 0.3081129/213 [=================>............] - ETA: 3:54 - loss: 23.0875 - accuracy: 0.3098130/213 [=================>............] - ETA: 3:51 - loss: 22.9261 - accuracy: 0.3103131/213 [=================>............] - ETA: 3:48 - loss: 22.7643 - accuracy: 0.3115132/213 [=================>............] - ETA: 3:45 - loss: 22.6033 - accuracy: 0.3127133/213 [=================>............] - ETA: 3:43 - loss: 22.4479 - accuracy: 0.3139134/213 [=================>............] - ETA: 3:40 - loss: 22.2910 - accuracy: 0.3155135/213 [==================>...........] - ETA: 3:37 - loss: 22.1437 - accuracy: 0.3160136/213 [==================>...........] - ETA: 3:34 - loss: 21.9970 - accuracy: 0.3157137/213 [==================>...........] - ETA: 3:31 - loss: 21.8517 - accuracy: 0.3168138/213 [==================>...........] - ETA: 3:29 - loss: 21.7042 - accuracy: 0.3188139/213 [==================>...........] - ETA: 3:26 - loss: 21.5622 - accuracy: 0.3195140/213 [==================>...........] - ETA: 3:23 - loss: 21.4230 - accuracy: 0.3201141/213 [==================>...........] - ETA: 3:20 - loss: 21.2848 - accuracy: 0.3207142/213 [===================>..........] - ETA: 3:17 - loss: 21.1491 - accuracy: 0.3217143/213 [===================>..........] - ETA: 3:15 - loss: 21.0144 - accuracy: 0.3219144/213 [===================>..........] - ETA: 3:12 - loss: 20.8800 - accuracy: 0.3234145/213 [===================>..........] - ETA: 3:09 - loss: 20.7467 - accuracy: 0.3248146/213 [===================>..........] - ETA: 3:06 - loss: 20.6190 - accuracy: 0.3260147/213 [===================>..........] - ETA: 3:03 - loss: 20.4919 - accuracy: 0.3263148/213 [===================>..........] - ETA: 3:01 - loss: 20.3695 - accuracy: 0.3271149/213 [===================>..........] - ETA: 2:58 - loss: 20.2409 - accuracy: 0.3289150/213 [====================>.........] - ETA: 2:55 - loss: 20.1207 - accuracy: 0.3304151/213 [====================>.........] - ETA: 2:52 - loss: 19.9976 - accuracy: 0.3315152/213 [====================>.........] - ETA: 2:49 - loss: 19.8786 - accuracy: 0.3331153/213 [====================>.........] - ETA: 2:47 - loss: 19.7635 - accuracy: 0.3329154/213 [====================>.........] - ETA: 2:44 - loss: 19.6450 - accuracy: 0.3348155/213 [====================>.........] - ETA: 2:41 - loss: 19.5274 - accuracy: 0.3359156/213 [====================>.........] - ETA: 2:38 - loss: 19.4113 - accuracy: 0.3369157/213 [=====================>........] - ETA: 2:35 - loss: 19.3008 - accuracy: 0.3370158/213 [=====================>........] - ETA: 2:33 - loss: 19.1902 - accuracy: 0.3374159/213 [=====================>........] - ETA: 2:30 - loss: 19.0780 - accuracy: 0.3390160/213 [=====================>........] - ETA: 2:27 - loss: 18.9702 - accuracy: 0.3400161/213 [=====================>........] - ETA: 2:24 - loss: 18.8616 - accuracy: 0.3422162/213 [=====================>........] - ETA: 2:21 - loss: 18.7516 - accuracy: 0.3445163/213 [=====================>........] - ETA: 2:19 - loss: 18.6469 - accuracy: 0.3457164/213 [======================>.......] - ETA: 2:16 - loss: 18.5431 - accuracy: 0.3470165/213 [======================>.......] - ETA: 2:13 - loss: 18.4385 - accuracy: 0.3492166/213 [======================>.......] - ETA: 2:10 - loss: 18.3347 - accuracy: 0.3511167/213 [======================>.......] - ETA: 2:07 - loss: 18.2311 - accuracy: 0.3527168/213 [======================>.......] - ETA: 2:05 - loss: 18.1362 - accuracy: 0.3529169/213 [======================>.......] - ETA: 2:02 - loss: 18.0391 - accuracy: 0.3541170/213 [======================>.......] - ETA: 1:59 - loss: 17.9451 - accuracy: 0.3542171/213 [=======================>......] - ETA: 1:56 - loss: 17.8509 - accuracy: 0.3545172/213 [=======================>......] - ETA: 1:53 - loss: 17.7571 - accuracy: 0.3554173/213 [=======================>......] - ETA: 1:51 - loss: 17.6638 - accuracy: 0.3559174/213 [=======================>......] - ETA: 1:48 - loss: 17.5739 - accuracy: 0.3560175/213 [=======================>......] - ETA: 1:45 - loss: 17.4828 - accuracy: 0.3573176/213 [=======================>......] - ETA: 1:42 - loss: 17.3934 - accuracy: 0.3581177/213 [=======================>......] - ETA: 1:40 - loss: 17.3080 - accuracy: 0.3584178/213 [========================>.....] - ETA: 1:37 - loss: 17.2262 - accuracy: 0.3583179/213 [========================>.....] - ETA: 1:34 - loss: 17.1408 - accuracy: 0.3591180/213 [========================>.....] - ETA: 1:31 - loss: 17.0553 - accuracy: 0.3595181/213 [========================>.....] - ETA: 1:28 - loss: 16.9727 - accuracy: 0.3598182/213 [========================>.....] - ETA: 1:26 - loss: 16.8903 - accuracy: 0.3602183/213 [========================>.....] - ETA: 1:23 - loss: 16.8080 - accuracy: 0.3607184/213 [========================>.....] - ETA: 1:20 - loss: 16.7259 - accuracy: 0.3609185/213 [=========================>....] - ETA: 1:17 - loss: 16.6462 - accuracy: 0.3611186/213 [=========================>....] - ETA: 1:14 - loss: 16.5629 - accuracy: 0.3631187/213 [=========================>....] - ETA: 1:12 - loss: 16.4885 - accuracy: 0.3633188/213 [=========================>....] - ETA: 1:09 - loss: 16.4107 - accuracy: 0.3639189/213 [=========================>....] - ETA: 1:06 - loss: 16.3339 - accuracy: 0.3643190/213 [=========================>....] - ETA: 1:03 - loss: 16.2589 - accuracy: 0.3655191/213 [=========================>....] - ETA: 1:01 - loss: 16.1843 - accuracy: 0.3657192/213 [==========================>...] - ETA: 58s - loss: 16.1109 - accuracy: 0.3659 193/213 [==========================>...] - ETA: 55s - loss: 16.0391 - accuracy: 0.3664194/213 [==========================>...] - ETA: 52s - loss: 15.9650 - accuracy: 0.3676195/213 [==========================>...] - ETA: 50s - loss: 15.8932 - accuracy: 0.3678196/213 [==========================>...] - ETA: 47s - loss: 15.8220 - accuracy: 0.3683197/213 [==========================>...] - ETA: 44s - loss: 15.7514 - accuracy: 0.3687198/213 [==========================>...] - ETA: 41s - loss: 15.6815 - accuracy: 0.3690199/213 [===========================>..] - ETA: 38s - loss: 15.6136 - accuracy: 0.3692200/213 [===========================>..] - ETA: 36s - loss: 15.5432 - accuracy: 0.3703201/213 [===========================>..] - ETA: 33s - loss: 15.4744 - accuracy: 0.3706202/213 [===========================>..] - ETA: 30s - loss: 15.4062 - accuracy: 0.3713203/213 [===========================>..] - ETA: 27s - loss: 15.3431 - accuracy: 0.3712204/213 [===========================>..] - ETA: 24s - loss: 15.2769 - accuracy: 0.3716205/213 [===========================>..] - ETA: 22s - loss: 15.2111 - accuracy: 0.3724206/213 [============================>.] - ETA: 19s - loss: 15.1476 - accuracy: 0.3726207/213 [============================>.] - ETA: 16s - loss: 15.0833 - accuracy: 0.3732208/213 [============================>.] - ETA: 13s - loss: 15.0224 - accuracy: 0.3729209/213 [============================>.] - ETA: 11s - loss: 14.9603 - accuracy: 0.3735210/213 [============================>.] - ETA: 8s - loss: 14.8968 - accuracy: 0.3740 211/213 [============================>.] - ETA: 5s - loss: 14.8328 - accuracy: 0.3750212/213 [============================>.] - ETA: 2s - loss: 14.7704 - accuracy: 0.3757213/213 [==============================] - ETA: 0s - loss: 14.7179 - accuracy: 0.3763213/213 [==============================] - 621s 3s/step - loss: 14.7179 - accuracy: 0.3763 - val_loss: 1.6975 - val_accuracy: 0.5188
   ams auc bei bue cai cap hon lag mex mos mum new per rio rom san syd van 
Accuracy: 6.874
